Revit 2027 API
BuiltInFailures.MEPCalculationFailures.NetworkErrorOverConstrained Property
 The calculation could not be performed due to overconstrained flow condition in the network.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NetworkErrorOverConstrained { get; }
Public Shared ReadOnly Property NetworkErrorOverConstrained As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NetworkErrorOverConstrained {
	FailureDefinitionId^ get ();
}
static member NetworkErrorOverConstrained : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPCalculationFailures Class
Autodesk.Revit.DB Namespace